Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.153/Microchip.PIC32CM-LE_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>PIC32CM-LE_DFP</name>
   <description>Microchip PIC32CM-LE Series Device Support</description>
   <releases>
      <release version="1.0.153" date="2022-03-21">
                - Initial release.
                - Headers minor version increased to v2.1.0.
                - Changed integer constant literal macros from _Ux_ to _UNITxx_ (where xx is 32, 16 or 8) (MISRA C2012:R12.2).
                - Added User ID write.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>PIC32CM-LE</keyword>
   </keywords>
   <devices>
      <family Dfamily="PIC32CM-LE" Dvendor="Microchip:3">
         <sequences><!-- added by ARM --><!-- Reset Stuff -->
            <sequence name="ForceCoreHalt">
               <block>
              __var DHCSR_Addr = 0xE000EDF0;
              __var DCRSR_Addr = 0xE000EDF4;
              __var DCRDR_Addr = 0xE000EDF8;
            </block>
               <!-- wait until core has stopped -->
               <control while="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0" timeout="100000"/>
               <block info="Halt core">
              Write32(DHCSR_Addr,0xA05F0003);                                  // halt core in any case
            </block>
               <block info="Update xPSR register">
              Write32(DCRDR_Addr, 0x01000000);
              Write32(DCRSR_Addr, 0x00010010);                                 // update xPSR register
            </block>
               <control while="(Read32(DHCSR_Addr) &amp; 0x00010000) == 0" timeout="100000"/>
            </sequence>
            <sequence name="ResetSystem" info="SYSRESETREQ">
               <block>
              __var AIRCR_Addr = 0xE000ED0C;
              __var DHCSR_Addr = 0xE000EDF0;

              __errorcontrol = 1;                                              // ignore errors
              Write32(AIRCR_Addr, 0x05FA0004);                                 // Execute SYSRESETREQ via AIRCR
              __errorcontrol = 0;                                              // check errors

              DAP_Delay(1000);                                                 // time for bootloader
            </block>
               <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
               <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) != 0" timeout="100000"/>
               <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
            </sequence>
            <sequence name="ResetProcessor" disable="true" info="VECTRESET"><!-- ResetProcessor not available for CM23 --></sequence>
            <sequence name="ResetHardware" info="HW RESET">
               <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;

              canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);     // Deassert nRESET line
            </block>
               <control while="(DAP_SWJ_Pins(0x00, nReset, 0) &amp; nReset) == nReset"
                        timeout="1000000"/>
               <!-- Keep reset active for 50 ms -->
               <control while="1" timeout="50000"/>
               <control if="canReadPins"><!-- Assert nRESET line and wait max. 1s for recovery -->
                  <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0"
                           timeout="1000000"/>
               </control>
               <control if="!canReadPins">
                  <block>
                DAP_SWJ_Pins(nReset, nReset, 0);                               // Assert nRESET line
              </block>
                  <!-- Wait 100ms for recovery if nRESET not readable -->
                  <control while="1" timeout="100000"/>
               </control>
               <!-- check if connection is used for target debug -->
               <control if="(__connection &amp; 0xFF) == 1">
                  <block>
                Sequence("ForceCoreHalt");                                     // halt the core
              </block>
               </control>
            </sequence>
            <!-- Reset Stuff -->
            <!-- Stop After Bootloader -->
            <sequence name="ResetCatchSet">
               <block>
              __var DHCSR_Addr    = 0xE000EDF0;
              __var DEMCR_Addr    = 0xE000EDFC;
              __var FP_CTRL_Addr  = 0xE0002000;
              __var FP_COMP0_Addr = 0xE0002008;
              __var FPB_KEY       = 0x00000002;
              __var FPB_ENABLE    = 0x00000001;
              __var value         = 0;
              __var resetVect     = 0x00000000;

              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; ~0x00000001));                  // Disable Reset Vector Catch


              resetVect = Read32(0x00000004);                                  // Read Reset Vector
              Write32(FP_COMP0_Addr, (resetVect | FPB_ENABLE));                // Set BP0 to Reset Vector (ARMv8M)
              Write32(FP_CTRL_Addr,  (FPB_KEY   | FPB_ENABLE));                // Enable FPB
            </block>
               <block>
              Read32(DHCSR_Addr);                                              // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
            </block>
            </sequence>
            <sequence name="ResetCatchClear">
               <block>
              __var DEMCR_Addr    = 0xE000EDFC;
              __var FP_CTRL_Addr  = 0xE0002000;
              __var FP_COMP0_Addr = 0xE0002008;
              __var FPB_KEY       = 0x00000002;
              __var value         = 0;

